#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_resource_group.terraform: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-10-12 19:27:50.454738533 +0000 UTC]
data.azurerm_resource_group.terraform: Read complete after 1s [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform]
module.services.azurerm_log_analytics_workspace.loganalyticsworkspace: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared]
module.services.azurerm_automation_account.automationaccount: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.Automation/automationAccounts/aa-services-itcc-devtst-shared]
azurerm_storage_account.storageaccount: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.Storage/storageAccounts/itccstorageaccountfa002]
module.services.azurerm_log_analytics_datasource_windows_event.law-services-data-win-event-sec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/law-services-data-win-event-sec]
module.services.azurerm_log_analytics_linked_service.loganalyticsworkspacelinkedservice: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/linkedServices/Automation]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_Write: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_Write]
module.services.azurerm_log_analytics_solution.loganalyticsworkspacesolution: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourcegroups/terraform/providers/Microsoft.OperationsManagement/solutions/Updates(law-services-itcc-devtst-shared)]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.Bytes_Total_PerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/Bytes_Total_PerSec]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_FreeSpace: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_FreeSpace]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_ReadsPerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_ReadsPerSec]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.Committed_BytesInUse: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/Committed_BytesInUse]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_QueueLenght: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_QueueLenght]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_TransfersPerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_TransfersPerSec]
module.services.azurerm_log_analytics_solution.law_solution_vminsights: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourcegroups/terraform/providers/Microsoft.OperationsManagement/solutions/VMInsights(law-services-itcc-devtst-shared)]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_FreeMB: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_FreeMB]
module.services.azurerm_management_lock.lock-law-services: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/providers/Microsoft.Authorization/locks/Delete]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.Bytes_Sent_PerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/Bytes_Sent_PerSec]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.Memory_AvailMbytes: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/Memory_AvailMbytes]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_WritesPerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_WritesPerSec]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.Bytes_Received_PerSec: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/Bytes_Received_PerSec]
module.services.azurerm_log_analytics_datasource_windows_event.law-services-data-win-event-sys: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/law-services-data-win-event-sys]
module.services.azurerm_log_analytics_solution.law_solution_changetracking: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourcegroups/terraform/providers/Microsoft.OperationsManagement/solutions/ChangeTracking(law-services-itcc-devtst-shared)]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.CPU_Time: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/CPU_Time]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.LogicalDisk_Read: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/LogicalDisk_Read]
module.services.azurerm_log_analytics_datasource_windows_performance_counter.CPU_QUEUE_Length: Refreshing state... [id=/subscriptions/ee67ae19-037f-4587-b5c3-7172b386a4da/resourceGroups/terraform/providers/Microsoft.OperationalInsights/workspaces/law-services-itcc-devtst-shared/dataSources/CPU_QUEUE_Length]
azurerm_storage_share.azureshare: Refreshing state... [id=https://itccstorageaccountfa002.file.core.windows.net/share1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_subnet.subnet1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "subnet1" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet1"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "terraform"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "xylosvnet001"

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "Get",
                ]
              + object_id               = "209a01d4-edf0-406e-a6ea-1291873a7529"
              + secret_permissions      = [
                  + "Get",
                ]
              + storage_permissions     = [
                  + "Get",
                ]
              + tenant_id               = "979687d9-d6a0-4081-b6ea-5c2b16d929b5"
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westeurope"
      + name                        = "xyloskeyvault"
      + purge_protection_enabled    = false
      + resource_group_name         = "terraform"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 7
      + tenant_id                   = "979687d9-d6a0-4081-b6ea-5c2b16d929b5"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_linux_virtual_machine.sftp will be created
  + resource "azurerm_linux_virtual_machine" "sftp" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "devtst"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "itcc-devtst-sftp-vm"
      + network_interface_ids           = (known after apply)
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "terraform"
      + size                            = "Standard_D2s_v3"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + name                      = "itcc-devtst-sftp-osdisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-focal"
          + publisher = "Canonical"
          + sku       = "20_04-lts"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.sftp will be created
  + resource "azurerm_network_interface" "sftp" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "itcc-devtst-sftp-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "terraform"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_virtual_network.virtualnetwork will be created
  + resource "azurerm_virtual_network" "virtualnetwork" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "xylosvnet001"
      + resource_group_name   = "terraform"
      + subnet                = [
          + {
              + address_prefix = "10.0.1.0/24"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
        ]
      + vm_protection_enabled = false
    }

  # random_password.sftp will be created
  + resource "random_password" "sftp" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @itccbe, Action: `pull_request`*